#### Importando as bibliotecas necessárias.

In [1]:
import pandas as pd
import datetime
import glob
import math

#### Instalando a biblioteca para conexão com o Banco de Dados.

In [4]:
!python3 -m pip install pymysql

WARNING: Keyring is skipped due to an exception: Failed to unlock the keyring!
WARNING: Keyring is skipped due to an exception: Failed to unlock the keyring!
Collecting pymysql
  WARNING: Keyring is skipped due to an exception: Failed to unlock the keyring!
  Using cached PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

#### Conexão com o banco de dados.

In [2]:
from sqlalchemy.engine import create_engine
engine = create_engine('mysql+pymysql://root:bootcamp@127.0.0.1:3307/employees')

### Criação do atributos **Satisfaction Level** e **Last_Evaluation**.

#### Carregando os dados de avaliação de desempenho.

In [6]:
df_performance_evaluation = pd.read_json("../datalake/landing/performance-evaluation/employee_performance_evaluation.json",orient="records",lines=True)

In [ ]:
# Windows
#df_performance_evaluation = pd.read_json("..\\datalake\\landing\\performance-evaluation\\employee_performance_evaluation.json",orient="records",lines=True)

In [7]:
df_performance_evaluation.head()

   emp_id  satisfaction_level  last_evaluation
0   10001                  38               53
1   10002                  80               86
2   10003                  11               88
3   10004                  72               87
4   10005                  37               52

### Criando o atributo Number_Project

#### Definindo a query para retorna o número de projetos por colaborador.

In [9]:
query = """SELECT Count(PROJECT_ID) as number_projects
FROM projects_emp
GROUP BY (emp_id);"""

In [12]:
pd.read_sql_query?

Signature:
pd.read_sql_query(
    sql,
    con,
    index_col=None,
    coerce_float=True,
    params=None,
    parse_dates=None,
    chunksize: Union[int, NoneType] = None,
) -> Union[pandas.core.frame.DataFrame, Iterator[pandas.core.frame.DataFrame]]
Docstring:
Read SQL query into a DataFrame.

Returns a DataFrame corresponding to the result set of the query
string. Optionally provide an `index_col` parameter to use one of the
columns as the index, otherwise default integer index will be used.

Parameters
----------
sql : str SQL query or SQLAlchemy Selectable (select or text object)
    SQL query to be executed.
con : SQLAlchemy connectable, str, or sqlite3 connection
    Using SQLAlchemy makes it possible to use any DB supported by that
    library. If a DBAPI2 object, only sqlite3 is supported.
index_col : str or list of str, optional, default: None
    Column(s) to set as index(MultiIndex).
coerce_float : bool, default True
    Attempts to convert values of non-string, non-numeric objects (like
    decimal.Decimal) to floating point. Useful for SQL result sets.
params : list, tuple or dict, optional, default: None
    List of parameters to pass to execute method.  The syntax used
    to pass parameters is database driver dependent. Check your
    database driver documentation for which of the five syntax styles,
    described in PEP 249's paramstyle, is supported.
    Eg. for psycopg2, uses %(name)s so use params={'name' : 'value'}.
parse_dates : list or dict, default: None
    - List of column names to parse as dates.
    - Dict of ``{column_name: format string}`` where format string is
      strftime compatible in case of parsing string times, or is one of
      (D, s, ns, ms, us) in case of parsing integer timestamps.
    - Dict of ``{column_name: arg dict}``, where the arg dict corresponds
      to the keyword arguments of :func:`pandas.to_datetime`
      Especially useful with databases without native Datetime support,
      such as SQLite.
chunksize : int, default None
    If specified, return an iterator where `chunksize` is the number of
    rows to include in each chunk.

Returns
-------
DataFrame or Iterator[DataFrame]

See Also
--------
read_sql_table : Read SQL database table into a DataFrame.
read_sql : Read SQL query or database table into a DataFrame.

Notes
-----
Any datetime values with time zone information parsed via the `parse_dates`
parameter will be converted to UTC.
File:      ~/.local/lib/python3.8/site-packages/pandas/io/sql.py
Type:      function

In [10]:
df_number_projects = pd.read_sql_query(query,engine)

In [11]:
df_number_projects.head()

   number_projects
0                2
1                5
2                7
3                5
4                2

### Criação do atributo **Mean_Work_Last_3_Months**.

#### Criando uma estrutura de Dataframe vazia.

In [13]:
df_sistema_ponto = pd.DataFrame(data=None, columns=["emp_id","data","hora"])

#### Carregando os dados do registro de horas trabalhadas.

In [14]:
for sheet in glob.glob("../datalake/landing/working-hours/*.xlsx"):
    df_ = pd.read_excel(sheet)
    df_sistema_ponto = pd.concat([df_sistema_ponto,df_])

<ipython-input-14-c7a80d65826f>:2: FutureWarning: Your version of xlrd is 1.2.0. In xlrd >= 2.0, only the xls format is supported. As a result, the openpyxl engine will be used if it is installed and the engine argument is not specified. Install openpyxl instead.
  df_ = pd.read_excel(sheet)

In [ ]:
# Windows
#for sheet in glob.glob("..\\datalake\\landing\\working-hours\\*.xlsx"):
    #df_ = pd.read_excel(sheet)
    #df_sistema_ponto = pd.concat([df_sistema_ponto,df_])

#### Convertendo os atributo para o tipo de dados datetime.

In [15]:
df_sistema_ponto["hora"] = pd.to_numeric(df_sistema_ponto["hora"])

In [22]:
df_sistema_ponto.head()

  emp_id       data  hora
0  22501 2020-05-31    13
1  22501 2020-06-01    11
2  22501 2020-06-02     4
3  22501 2020-06-03     5
4  22501 2020-06-04    14

#### Filtrando apenas os registros dos últimos 3 meses.

In [16]:
df_last_3_month = df_sistema_ponto[(df_sistema_ponto['data'] > datetime.datetime(2020,9,30))]

#### Verificando a contagem de registros por colaborador.

In [17]:
df_last_3_month.groupby("emp_id").count()

        data  hora
emp_id
10001     92    92
10002     92    92
10003     92    92
10004     92    92
10005     92    92
...      ...   ...
24996     92    92
24997     92    92
24998     92    92
24999     92    92
25000     92    92

[15000 rows x 2 columns]

#### Calculando o valor médio da quantidade de horas nos últimos 3 meses.

In [18]:
mean_work_last_3_months = df_last_3_month.groupby("emp_id")["hora"].agg("sum")/3

#### Atribuindo os dados ao Dataframe para a verificação.

In [19]:
mean_work_last_3_months = pd.DataFrame(data=mean_work_last_3_months)

In [20]:
mean_work_last_3_months.rename(columns={"hora":"mean_work_last_3_months"},inplace=True)

In [21]:
mean_work_last_3_months.head()

        mean_work_last_3_months
emp_id
10001                266.000000
10002                252.000000
10003                289.666667
10004                275.666667
10005                292.333333

### Criando o atributo Time_in_Company

#### Definindo uma data de referencia.

In [23]:
date_referencia = datetime.date(2021, 1, 1)

#### Definindo a query para retornar os dados do banco de dados.

In [24]:
query = """SELECT hire_date
FROM employees;"""

In [25]:
df_hire_date = pd.read_sql_query(query,engine)

In [26]:
df_hire_date.head()

    hire_date
0  2018-01-17
1  2015-02-02
2  2017-01-22
3  2016-01-28
4  2018-01-17

#### Convertendo o tipo de dados para datetime.

In [27]:
df_hire_date["hire_date"] = pd.to_datetime(df_hire_date["hire_date"])

#### Calculando a diferença em dias a partir da data de contratação do colaborador até a data de referencia.

In [28]:
days_diff = []
for d in df_hire_date["hire_date"]:
    diff = date_referencia - d.date()
    days_diff.append(diff.days)

In [32]:
days_diff[:10]

[1080, 2160, 1440, 1800, 1080, 1080, 1440, 1800, 1800, 1080]

#### Convertendo o número de dias em quantidade de anos.

In [29]:
nyears = []
for ndays in days_diff:
    nyears.append(int(math.ceil(ndays / 365)))

In [33]:
nyears[:10]

[3, 6, 4, 5, 3, 3, 4, 5, 5, 3]

#### Atribuindo os dados ao Dataframe para verificação.

In [34]:
df_hire_date["time_in_company"] = nyears

In [35]:
df_hire_date.head()

   hire_date  time_in_company
0 2018-01-17                3
1 2015-02-02                6
2 2017-01-22                4
3 2016-01-28                5
4 2018-01-17                3

### Criando o atributo Work_Accident

#### Carregando os dados a partir do banco de dados.

In [36]:
df_employees = pd.read_sql_table("employees",engine)

In [37]:
df_accident = pd.read_sql_table("accident",engine)

#### Verificando quais colaboradores sofreram acidente.

In [38]:
work_accident = []
for emp in df_employees["emp_no"]:
    if emp in df_accident["emp_no"].to_list():
        work_accident.append(1)
    else:
        work_accident.append(0)

#### Atribuindo ao Dataframe para verificação.

In [39]:
df_work_accident = pd.DataFrame(data=None, columns=["work_accident"])

In [40]:
df_work_accident["work_accident"] = work_accident

In [42]:
df_work_accident.head()

   work_accident
0              0
1              0
2              0
3              0
4              0

### Criando os atributos Department, Salary e Left

#### Definindo a query para retornar os atributos.

In [43]:
query = """SELECT emp.department as department,sal.salary as salary, emp.left
FROM employees emp
INNER JOIN salaries sal
ON emp.emp_no = sal.emp_id;
"""

In [44]:
df_department_salary_left = pd.read_sql_query(query,engine)

In [45]:
df_department_salary_left.head()

  department  salary  left
0      sales     low     1
1      sales  medium     1
2      sales  medium     1
3      sales     low     1
4      sales     low     1